In [1]:
import pandas as pd

In [2]:
row1 = ["ST0001","S23 MODEL"]
row2 = ["ST0002","S22 MODEL"]
row3 = ["ST0003","S21 MODEL"] 
productData = pd.DataFrame([ row1,row2,row3], columns = ["PRODUCT_CODE","PRODUCT_ACTUAL_NAME"])

In [3]:
productData

  PRODUCT_CODE PRODUCT_ACTUAL_NAME
0       ST0001           S23 MODEL
1       ST0002           S22 MODEL
2       ST0003           S21 MODEL

In [5]:
joinSellout = pd.read_csv("../../../stdcode6/dataset/join_kopo_product_volume.csv")

In [7]:
joinSellout

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [14]:
mergedData = pd.merge(left=joinSellout,
                      right=productData,
                      left_on=["PRODUCT"],
                      right_on=["PRODUCT_CODE"],
                     how="inner")

In [15]:
mergedData

  REGIONID PRODUCT  YEARWEEK   QTY PRODUCT_CODE PRODUCT_ACTUAL_NAME
0      A01  ST0001    201901  3000       ST0001           S23 MODEL
1      A01  ST0001    201902  3500       ST0001           S23 MODEL
2      A02  ST0002    201901  4000       ST0002           S22 MODEL
3      A02  ST0003    201902  7000       ST0003           S21 MODEL

In [ ]:
# 1. join key를 잘 살펴봐야 한다. join key를 잘못 세팅하면 데이터가 섞여버립니다.

In [18]:
pd.merge(left=joinSellout, right=productData,
         left_on=["PRODUCT"], right_on=["PRODUCT_CODE"],
         how="inner")

  REGIONID PRODUCT  YEARWEEK   QTY PRODUCT_CODE PRODUCT_ACTUAL_NAME
0      A01  ST0001    201901  3000       ST0001           S23 MODEL
1      A01  ST0001    201902  3500       ST0001           S23 MODEL
2      A02  ST0002    201901  4000       ST0002           S22 MODEL
3      A02  ST0003    201902  7000       ST0003           S21 MODEL